#виконайте добуток двох квадратних матриць 3*3, врахуйте розмірність.
#результати множення елементів занесіть до нової матриці та виведіть її на екран;
import numpy as np
a = 3#розмірність масиву
b = 3#розмірність масиву
mas = []#перша матриця
mas_2=[]#друга матриця
for i in range(a):
    d=[]#доб. масив
    for j in range(b):
        d.append(int(input("введите первую матрицу по елементно:")))#вод матрици по елеметно
    mas.append(d)#добавляем елемнти в первую матрицу
for i in range(a):
    c=[]#доб. масив
    for j in range(b):#
        c.append(int(input("введите вторуюматрицу по елементно:")))#вод матрици по елеметно
    mas_2.append(c)#добавляем елемнти в 2 матрицу
c=np.array(mas)
b=np.array(mas_2)
g=c.dot(b)#пермножение
print(g)