#лінійний пошук;
import numpy as np
import random
while True:

    g = input("елси вы хотите , числа были рандомние нажмите <<enter>>'. Для введення вручную нажмите любую клавишу: ")
#вибираємо як буде проходити пошук
    a = np.zeros(10, dtype=int)
    x = int(input('елемент который мы ищем: '))#вводимо число яке будемо шукати

    n = len(a)

    if g == '':#якщо користувач хоче щоб пошук відбувся ранодомно

        q1 = int(input('левая граница: '))#вводимо ліву границу від якого буду гереруватися числа
        q2 = int(input('правая граница: '))#вводимо праву границу від якого буду гереруватися числа

        for i in range(10):
            a[i] = random.randint(q1, q2)#генеруємо числа рандомно
    else:
        for i in range(10):
            a[i] = int(input('введите по елементно: '))# якщо корисвтувач буде вводити числа самостайно йому буде написаоно ця строка і потрбно буде вводити елементи
    print(a)

    i = 0
    count = 0#cчётчик
    while i < n and a[i] != x: #поки i !=n i елемент пошуку не = х буде проводитися пошук
        i += 1
        count += 2#счётчик покзаивает соклтко раз было сделано сравнение
    if i == n:#якщо i=n то елементи не найдены
        print('елемент нне найден')
    else: # елси наоборот то будет показана позиция где найдено чесло
        print(f"елемент {x} найден на {i + 1} позиции")
    print(f"сравнювалось{count} раз")
    if input('Нажмите "Enter" (введите пустую строку (\'\')) для перезапуска: ') == '':
        continue
    break