#бінарний пошук;
import numpy as np
import random
while True:

    g = input("елси вы хотите , числа были рандомние нажмите <<enter>>'. Для введення вручную нажмите любую клавишу: ")#
#вибираємо як буде проходити пошук
    a = np.zeros(10, dtype=int)
    while True:
        try:
            x = int(input('введите искамое число: '))#вводимо число яке будемо шукати
            break
        except ValueError:
            print("только числа")
    n = len(a)

    if g== '':#якщо користувач хоче щоб пошук відбувся ранодомно
        while True:
            try:
                q1 =int(input("Введите левую границу: "))#вводимо ліву границу від якого буду гереруватися числа
                q2=int(input("введите правую гаринц: "))#вводимо праву границу від якого буду гереруватися числа
                break
            except ValueError:
                print("только цифри")

        for i in range(10):
            a[i] = random.randint(q1, q2)#генеруємо числа рандомно
    else:
        for i in range(10):
            a[i] = int(input(f'Enter {i + 1} element: '))# якщо корисвтувач буде вводити числа самостайно йому буде написаоно ця строка і потрбно буде вводити елементи
    print(a)

    a = sorted(a)#сортуємо наш масив
    print(a)
    l = 0#левая граница
    r = len(a) - 1#правя граница
    k = 0# золота середина
    count = 0# счётчик
    flag = False
    while l <= r and not flag: #поки l=r i flag!= true програма будет раьотат
        count += 2#счётчик покзаивает соклтко раз было сделано сравнение
        k = (l + r) // 2#формула поиска
        if a[k] == x:#елси елемент найден то flag = true то цикл станет
            flag = True

        elif a[k] < x:#обризаем граници елси к<x то обризаем левую границу
            count += 1
            l = k + 1
        else:#обризаем граници елси к>x то обризаем правую  границу
            count += 1
            r = k - 1
    if not flag:#если флаг не поменлся то елемент не найден
        print('ЕЛЕМЕНТ НЕ НАЙДЕН')
    else:#если флаг  поменлся то елемент найден
        print(f'елемнт найден{x} на {k + 1} позици ')
    print(f"Сравнения были выполнены{count} ")
    if input('Нажмите "Enter" (введите пустую строку (\'\')) для перезапуска: ') == '':
        continue
    break
