#у матриці 4*4, що задана користувачем замініть всі від’ємні елементи на 0.
import numpy as np
a = 4#розмірність масиву
b = 4#розмірність масиву
mas = []#матрица
for i in range(a):
    d = []#доб.масив
    for j in range(b):
        d.append(int(input("введите :")))#введение
    mas.append(d)#добавления елеменетво масиву в матрицу
for i in range(4):#перебор мотриц
    for j in range(4):#перебор матриц
        if mas[i][j] <0:#если какй-то елемент маисву меньше нуля
            mas[i][j]="0"#то ми заменяем его на 0
g=np.array(mas)
print(g)#вивод