#прямий пошук підрядка.
import random


while True:
    text = "l like my mam." #підготовлений текс для рандомного пошука
    flag = input("елси вы хотите , числа были рандомние нажмите <<enter>>'. Для введення вручную нажмите любую клавишу: ")

    if flag == '':#якщо користувач вибрав рандомно найти
        str_find = ['like', 'i', 'my']#славі які будемо шукати при радномному пошку
        pattern = random.choice(str_find)#рандомний вибір
        print(pattern)

    else:#якщо користувач сам буде вводити слова
        pattern = input('введите слова: ')#ввод

    i = -1
    #границі
    j = 0
    count = 0
    while (j < len(pattern)) and i < (len(text) - len(pattern)): #поки j<довжини рандомно вибраного слова и i<(довжини текст - довжин слова)

        j = 0
        i += 1
        count += 2
        while j < len(pattern) and pattern[j] == text[i + j]:#поки j<довжину слова вибраного рандомно  і поки вибране слово == сумі i+j
             j += 1
             count += 2
    if j == len(pattern):# якщо j=вибраному слову то елемен найдений
        print(f'слова найдены на {i + 1} позиции ')
    else:#якщо ні то елемент не знайдено
        print('слова не найдены ')

    if input('Нажмите "Enter" (введите пустую строку (\'\')) для перезапуска: ') == '':
        continue
    break